
api_id = 1427324
api_hash = "6c6ad7a040116bf1254c00393780c76b"
phone_number = "89506218552"
sms_api = '46495BCB-59C8-CC6C-5D68-E4C0D5EA38F7'
channel_username = '@AcademyPickBot'
all_numbers = '79056676893,79601668666,79036050705,79519056590,79601827236,79267138797,79200738383'


class Templates:
    @staticmethod
    def answer_1():
        return 'Приветствую Вас! 👋\n🤖 Я — чат-бот "Академии" для создания видеороликов о Ваших крутых заездах. 🎬'

    @staticmethod
    def answer_2():
        return 'Давайте попробуем вместе создать ВАШ видеоролик! 📽\nНам понадобится короткое видео (до 10 секунд) и 2 фотографии.\nИтак, приступим. Следуйте инструкциям 👇'

    @staticmethod
    def answer_3():
        return 'Снимите или загрузите видео (не дольше 10 секунд) с Вашим участием в заезде или ожиданием в паддоке, и отправьте его чат-боту с телефона 📱.'

    @staticmethod
    def answer_4():
        return 'Сделайте и отправьте селфи 🤳 на фоне трассы, паддока или пьедестала награждения.'

    @staticmethod
    def answer_5():
        return 'Прикрепите еще одно селфи 🤳\nСовет: лучше сменить локацию или пригласить друзей сделать селфи вместе с Вами.\nБольше импровизации — интересней видеоролик. 😉'

    @staticmethod
    def answer_6():
        return 'Придумайте подпись к селфи (не более 3 слов) и отправьте сообщением в чат-бота.'

    @staticmethod
    def answer_7():
        return 'Видеоролик в процессе монтажа.\nПотребуется порядка 1–2 минут. ⏱\nОжидайте... 🚀'

    @staticmethod
    def answer_8():
        return 'В работе...'

    @staticmethod
    def answer_9():
        return ''

    @staticmethod
    def answer_10():
        return '👌 Видеоролик готов! ⬆\n▫\n🔸 Осталось поделиться им с друзьями 😎:\n1. сохраните видеоролик у себя на устройстве.\n2. разместите пост c видеороликом в социальных сетях (Instagram, Vkontakte, Tik-Tok, Like, YouTube).'
