

class Templates_AcademyPickBot:
    @staticmethod
    def answer_1():
        return 'Приветствую Вас! 👋\n🤖 Я — чат-бот "Академии" для создания видеороликов о Ваших крутых заездах. 🎬'

    @staticmethod
    def answer_2():
        return 'Давайте попробуем вместе создать ВАШ видеоролик! 📽\nНам понадобится короткое видео (до 10 секунд) и 2 фотографии.\nИтак, приступим. Следуйте инструкциям 👇'

    @staticmethod
    def answer_3():
        return 'Снимите или загрузите видео (не дольше 10 секунд) с Вашим участием в заезде или ожиданием в паддоке, и отправьте его чат-боту с телефона 📱.'

    @staticmethod
    def answer_4():
        return 'Сделайте и отправьте селфи 🤳 на фоне трассы, паддока или пьедестала награждения.'

    @staticmethod
    def answer_5():
        return 'Прикрепите еще одно селфи 🤳\nСовет: лучше сменить локацию или пригласить друзей сделать селфи вместе с Вами.\nБольше импровизации — интересней видеоролик. 😉'

    @staticmethod
    def answer_6():
        return 'Придумайте подпись к селфи (не более 3 слов) и отправьте сообщением в чат-бота.'

    @staticmethod
    def answer_7():
        return 'Видеоролик в процессе монтажа.\nПотребуется порядка 1–2 минут. ⏱\nОжидайте... 🚀'

    @staticmethod
    def answer_8():
        return 'В работе...'

    @staticmethod
    def answer_9():
        return ''

    @staticmethod
    def answer_10():
        return '👌 Видеоролик готов! ⬆\n▫\n🔸 Осталось поделиться им с друзьями 😎:\n1. сохраните видеоролик у себя на устройстве.\n2. разместите пост c видеороликом в социальных сетях (Instagram, Vkontakte, Tik-Tok, Like, YouTube).'



class Templates_hi_prof_bot:
    @staticmethod
    def answer_1():
        return 'Привет👋\n🤖 Я — чат-бот автошколы "Автофакультет" для создания Ваших видеороликов!\n⠀\nНачиная с сегодняшнего дня, Вам предоставляется уникальная возможность получить 100% обучения в подарок, а так же новый опыт и неповторимые возможности!\n⠀\nЧто для этого необходимо?\n⠀\nМы хотим предложить Вам инновационную технологию создания профессиональных видеороликов сохраняющую лучшие моменты вашего обучения, впервые в России применяемую в автошколе «Автофакультет».\n⠀\nВы можете делиться этими видеороликами с друзьями и знакомыми и стать настоящей звездой соцсетей. А самому активному 01 Ноября 2020 мы вручаем главный приз!\n⠀\nПройти профессиональное обучение постоянно наслаждаясь его самыми яркими моментами — незабываемо! А получить супер-бонус возврат денежных средств — вдвойне приятно!'

    @staticmethod
    def answer_2():
        return 'Давайте попробуем вместе создать ВАШ яркий видеоролик. 📽'

    @staticmethod
    def answer_3():
        return 'Нам понадобится короткое видео (до 10 секунд).\nИ одно Ваше фото.'

    @staticmethod
    def answer_4():
        return 'Итак, приступим.\nСледуйте инструкциям 👇'

    @staticmethod
    def answer_5():
        return 'Снимите или загрузите видео протяженностью до 10с с Вашим участием.\nОтправьте видео чат-боту.'

    @staticmethod
    def answer_6():
        return 'Сделайте и отправьте селфи 🤳 на фоне автомобиля)'

    @staticmethod
    def answer_7():
        return 'Видеоролик в процессе монтажа.\nПотребуется порядка 1–2 минут. ⏱\nОжидайте... 🚀 Будет бомба!'

    @staticmethod
    def answer_8():
        return 'В работе...'

    @staticmethod
    def answer_9():
        return ''

    @staticmethod
    def answer_10():
        return '👌 Видеоролик готов. ⬆\n▫\n🔸 Осталось поделиться им с друзьями! 😎\n▫\nКак это сделать?\n▫\nВсе просто:\n1. сохраните видеоролик у себя на устройстве.\n2. отправьте его сообщением в любом мессенджере или разместите пост в социальных сетях.\n▫\n+ 🔸 Ну что, попробуем сделать еще один видеоролик?\nНажмите внизу кнопку "Сделать еще один видеоролик".'



class Templates_kurtsevobot:
    @staticmethod
    def answer_1():
        return 'Приветствую Вас! 👋\nЯ - чат-бот 🤖 Конно-спортивного клуба "Курцево". Я расскажу вам о наших лошадях, помогу забронировать катание на коне, и создам для вас яркое видео с воспоминаниями с конной прогулки 🎬\n👇 посмотрите пример 👇'

    @staticmethod
    def answer_2():
        return 'Давайте попробуем вместе создать новый видеоролик.📽\nНам понадобится короткое видео (до 10 секунд) и 1 фотография.\nИтак, приступим.'

    @staticmethod
    def answer_3():
        return 'Загрузите небольшое вертикальное видео (не дольше 10 секунд) с вашими воспоминаниями из клуба. Отправьте его ответным сообщением.'

    @staticmethod
    def answer_4():
        return 'Загрузите свое фото с конной прогулки 🤳'

    @staticmethod
    def answer_5():
        return 'Видеоролик в процессе монтажа.\nПотребуется порядка 1-2 минут.⏱\nОжидайте...🚀'

    @staticmethod
    def answer_6():
        return 'Ролик в работе.'

    @staticmethod
    def answer_7():
        return ''

    @staticmethod
    def answer_8():
        return '👌Видеоролик готов!⬆\n▫\n🔸Осталось поделиться им с друзьями.😎\nКак это сделать? Все просто:\n1️⃣ сохраните видеоролик у себя на устройстве.\n2️⃣ отправьте его сообщением в любом мессенджере или разместите пост в социальных сетях.\n▫\n🔸Хотите поблагодарить разработчика чат-бота или дать свои рекомендации - нажмите внизу кнопку "Оставить отзыв".👇\n▫\n🔸Хотите заказать себе такого чат-бота - нажмите внизу кнопку "Заказать чат-бота".👇\n▫\n🔸Ну что, попробуем сделать еще один видеоролик? Нажмите внизу кнопку "Сделать еще один видеоролик".👇'



class Templates_DadiRestBot:
    @staticmethod
    def answer_1():
        return 'Привет!\nЯ — чат бот 🤖 ресторана Дади.\nЗдесь Вы можете узнать всё о нашем ресторане и меню, забронировать столик или сделать своё видеовоспоминание о визите к нам. Наслаждайтесь! ☺'

    @staticmethod
    def answer_2():
        return 'Чем я могу Вам помочь? 🤝'

    @staticmethod
    def answer_3():
        return '👐 Давайте вместе создадим Ваше видео воспоминание о визите в Дади 🎬'

    @staticmethod
    def answer_4():
        return 'Итак, нам понадобится Ваше фото и короткое видео! Все очень просто'

    @staticmethod
    def answer_5():
        return 'Снимите/загрузите короткое видео (до 10 с) в вертикальном формате в кафе Дади. Отправьте его чат-боту.'

    @staticmethod
    def answer_6():
        return 'Отлично! 🤳 Теперь загрузите Ваше фото в Дади в вертикальном формате и отправьте его чат-боту'

    @staticmethod
    def answer_7():
        return 'Ура! мы начали изготовление Вашего видео!\nПотребуется порядка 1–2 минут. ⏱'

    @staticmethod
    def answer_8():
        return 'В работе...'

    @staticmethod
    def answer_9():
        return ''

    @staticmethod
    def answer_10():
        return '👌 Видео готово! ⬆\n▫\n🔸 Осталось поделиться им с друзьями. 😎\nКак это сделать? Все просто:\n1. сохрани его у себя на устройстве.\n2. отправь его сообщением в любом мессенджере или размести пост в социальных сетях.\n▫\n🔸 Ну что, попробуем сделать еще одно? Нажми внизу кнопку "Сделать еще одно видео". 👇'



class Templates_TourPickBot:
    @staticmethod
    def answer_1():
        return 'Приветствую Вас!👋\nЯ - демонстрационный чат-бот 🤖 по созданию видеороликов о посещении различных достопримечательностей.🎬'

    @staticmethod
    def answer_2():
        return 'Давайте попробуем вместе создать новый видеоролик.📽\nНам понадобится короткое видео (до 10 секунд) и 2 фотографии.'

    @staticmethod
    def answer_3():
        return 'Снимите видео с Вашим участием около достопримечательности, прикрепите и отправьте его сообщением в чат-бот с телефона 📱.'

    @staticmethod
    def answer_4():
        return 'Прикрепите и оправьте селфи🤳 на фоне достопримечательности.'

    @staticmethod
    def answer_5():
        return 'Напишите подпись к селфи (не более 3 слов) и отправьте сообщением в чат-бота.'

    @staticmethod
    def answer_6():
        return 'Прикрепите еще одно селфи🤳 на фоне достопримечательности.\nСовет: лучше сменить локацию или пригласить друзей сделать селфи вместе с Вами.\nБольше импровизации - интересней видеоролик.😉'

    @staticmethod
    def answer_7():
        return 'Видеоролик в процессе монтажа.\nПотребуется порядка 1-2 минут.⏱\nОжидайте...🚀'

    @staticmethod
    def answer_8():
        return ''

    @staticmethod
    def answer_9():
        return ''

    @staticmethod
    def answer_10():
        return '👌Видеоролик готов!⬆\n▫\n🔸Осталось поделиться им с друзьями.😎\nКак это сделать? Все просто:\n1️⃣ сохраните видеоролик у себя на устройстве.\n2️⃣ отправьте его сообщением в любом мессенджере или разместите пост в социальных сетях.\n▫\n🔸Хотите поблагодарить разработчика чат-бота или дать свои рекомендации - нажмите внизу кнопку "Оставить отзыв".👇\n▫\n🔸Хотите заказать себе такого чат-бота - нажмите внизу кнопку "Заказать чат-бота".👇\n▫\n🔸Ну что, попробуем сделать еще один видеоролик? Нажмите внизу кнопку "Сделать еще один видеоролик".👇'


